pmo-dataset/variations/graphviz_with_ids/05.dot
digraph G {
  rankdir=LR;  
  node [shape=box];

  "Task_1" [label="Sign contract"];
  "Task_2" [label="Conduct site visit"];
  "Task_3" [label="Execute contract"];
  "Task_4" [label="Identify need for\nnew supplier or\nvendor"];
  "Task_5" [label="Evaluate proposal"];
  "Task_6" [label="Receive supplier\nproposals"];
  "Task_7" [label="Begin contract\nnegotiations"];
  "Task_8" [label="Select supplier"];
  "Task_9" [label="Conduct interview"];
  "Task_10" [label="Issue request for\nproposals (RFP)"];
  "Task_11" [label="Onboard supplier"];
  "StartNoneEvent_1" [shape=circle, label="start"];
  "EndNoneEvent_1" [shape=circle, penwidth=4, label="end"];
  "ExclusiveGateway_1" [shape=diamond, label="X"];
  "ExclusiveGateway_2" [shape=diamond, label="X"];
  "ExclusiveGateway_3" [shape=diamond, label="X"];
  "ExclusiveGateway_4" [shape=diamond, label="X"];

  "Task_2" -> "ExclusiveGateway_1";
  "ExclusiveGateway_4" -> "ExclusiveGateway_1";
  "ExclusiveGateway_4" -> "Task_9";
  "ExclusiveGateway_2" -> "Task_8";
  "Task_3" -> "EndNoneEvent_1";
  "Task_6" -> "ExclusiveGateway_3";
  "StartNoneEvent_1" -> "Task_4";
  "ExclusiveGateway_3" -> "Task_5";
  "Task_9" -> "ExclusiveGateway_1";
  "Task_7" -> "Task_1";
  "ExclusiveGateway_4" -> "Task_2";
  "ExclusiveGateway_1" -> "ExclusiveGateway_2";
  "Task_1" -> "Task_11";
  "Task_10" -> "Task_6";
  "Task_5" -> "ExclusiveGateway_4";
  "Task_11" -> "Task_3";
  "ExclusiveGateway_2" -> "ExclusiveGateway_3";
  "Task_8" -> "Task_7";
  "Task_4" -> "Task_10";
}
